{
    "status": "success",
    "totalResults": 94438,
    "results": [
        {
            "title": "New passing lanes west of Prince Albert officially opened",
            "link": "https://panow.com/2021/10/18/new-passing-lanes-west-of-prince-albert-officially-opened/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "A highway improvement west of Prince Albert, designed to save lives and accomodate increasing demands from local industry, has officially been complet...",
            "content": "A highway improvement west of Prince Albert, designed to save lives and accomodate increasing demands from local industry, has officially been completed. A ribbon cutting ceremony Monday marked the end of work on three sets of passing lanes on Highway 3 west. The $9.1 million project was officially announced by the government in Spring of 2020. Highways Minister Fred Bradshaw explained that with a number of big announcements recently from companies like Paper Excellence, it’s become even more important to ensure there is a safe and reliable transportation system. “We are going to have a lot more logging trucks going on there so this is going to make it a lot safer for the people who are commuting back and forth between Shellbrook and also for all the trucking companies that are going to be operating,” he said. Highway Minister Fred Bradshaw. (Nigel Maxwell/ paNOW Staff) According to statistics provided earlier by the Reeve for the Rural Municipality (RM) of Buckland, there has been 414 collisions on Highway 3 between Prince Albert and Shellbrook in the last decade. From those, 67 have resulted in some form of personal injury and there has been five fatalities including the three lives lost just before Christmas last year. Less than two kilometres from where the MLAs gathered Monday, was a vigil marking one of those deaths. Bradshaw said he believes the new passing lanes will make a difference. “We found everywhere where we have put in passing lanes the accident rate has gone way down,” he said. Prince Albert Carlton MLA Joe Hargrave looks on as RM of Shellbrook expresses his gratitude seeing the project complete. (Nigel Maxwell/ paNOW Staff) This passing lane project is one of many highway construction projects in the Prince Albert area. This past July saw the opening of five sets of passing lanes on Highway 2 north and later this fall, pre-construction is scheduled to begin on about seven kilometres of twinning west of Prince Albert. Bradshaw anticipated ground breaking to begin next year. RM of Shellbrook Reeve Doug Oleksyn, who was also on hand for Monday’s announcement, acknowledged the construction delays have been challenging. “There’s that short tem pain and now you have the gain,” he said. Shellbrook Mayor Amund Otterson agreed the new passing lanes will help commuters. “It will help reduce stress and provide a better quality of life as a result,” he said This vigil, located just east of Monday’s press conference, is a visible reminder of the tragedies that have occurred along Highway 3 West. (Nigel Maxwell/ paNOW Staff) Construction of 30 new sets of passing lanes have and will be added to Saskatchewan’s road network over next year, which is in addition to 27 sets of passing lanes built in the last four years. As part of its ten year Growth Plan, the Government of Saskatchewan committed to build and improve 10,000 kilometres of provincial roads and highways. More than 1,350 kilometres were improved this year. — nigel.maxwell@pattisonmedia.com On Twitter: @nigelmaxwell",
            "pubDate": "2021-10-18 19:36:32",
            "image_url": "https://s3.amazonaws.com/socast-superdesk/media/20211018181028/e86f6505-d61f-4108-9e83-aebe4cddc549.jpg",
            "source_id": "panow"
        },
        {
            "title": "Cancer cells mobilizing the nervous system? Let's use them to inhibit the tumor",
            "link": "https://medicalxpress.com/news/2021-10-cancer-cells-mobilizing-nervous-inhibit.html",
            "keywords": [
                "Oncology & Cancer"
            ],
            "creator": null,
            "video_url": null,
            "description": "Researchers at the Technion—Israel Institute of Technology have developed an innovative treatment for breast cancer, based on analgesic nanoparticles that target the nervous system. The study, published in Science Advances, was led by Professor Avi Schroeder and Ph.D. student Maya Kaduri of the Wolfson Faculty of Chemical Engineering.",
            "content": null,
            "pubDate": "2021-10-18 19:35:34",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2015/6-breastcancer.jpg",
            "source_id": "medicalxpress"
        },
        {
            "title": "Neuroinflammation protein linked to worse survival in men with glioblastoma",
            "link": "https://medicalxpress.com/news/2021-10-neuroinflammation-protein-linked-worse-survival.html",
            "keywords": [
                "Oncology & Cancer"
            ],
            "creator": null,
            "video_url": null,
            "description": "Scientists have discovered a new link that could bring the scientific and medical community closer to understanding why glioblastoma, the most common malignant brain tumor, is deadlier in males than females.",
            "content": null,
            "pubDate": "2021-10-18 19:35:28",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/neuroinflammation-prot.jpg",
            "source_id": "medicalxpress"
        },
        {
            "title": "Powerful new technique allows scientists to study how proteins change shape inside cells",
            "link": "https://phys.org/news/2021-10-powerful-technique-scientists-proteins-cells.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Understanding how proteins bend, twist, and shape-shift as they go about their work in cells is enormously important for understanding normal biology and diseases. But a deep understanding of protein dynamics has generally been elusive due to the lack of good imaging methods of proteins at work. Now, for the first time, scientists at the UNC School of Medicine have invented a method that could enable this field to take a great leap forward.",
            "content": null,
            "pubDate": "2021-10-18 19:35:17",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2019/proteins.jpg",
            "source_id": "phys"
        },
        {
            "title": "Long-term exposure to toxins in operating rooms could increase COPD risk",
            "link": "https://medicalxpress.com/news/2021-10-long-term-exposure-toxins-rooms-copd.html",
            "keywords": [
                "Diseases",
                "Conditions",
                "Syndromes"
            ],
            "creator": null,
            "video_url": null,
            "description": "Disinfectants and surgical smoke—the gaseous by-product produced by heat-generating surgical instruments—are among the hazardous chemicals to which physicians, nurses, and other hospital staff are exposed in operating rooms (OR) during electrosurgery and laser procedures.",
            "content": null,
            "pubDate": "2021-10-18 19:35:10",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2018/1-operatingroom.jpg",
            "source_id": "medicalxpress"
        },
        {
            "title": "Post-stroke rehabilitation proves more effective when vibratory stimulus coincides",
            "link": "https://medicalxpress.com/news/2021-10-post-stroke-effective-vibratory-stimulus-coincides.html",
            "keywords": [
                "Neuroscience"
            ],
            "creator": null,
            "video_url": null,
            "description": "Every 40 seconds someone in the U.S. experiences a stroke, according to the Centers for Disease Control and Prevention. And because stroke is the country's leading cause of long-term disability, the effectiveness of post-stroke rehabilitation is vital to a person's quality of life.",
            "content": null,
            "pubDate": "2021-10-18 19:35:02",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/poststroke-rehabilitat.jpg",
            "source_id": "medicalxpress"
        },
        {
            "title": "Researchers develop self-healing polymers for cracked cellphone screens",
            "link": "https://phys.org/news/2021-10-self-healing-polymers-cellphone-screens.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "If you're like most cellphone users, at one point you have experienced a cracked screen.",
            "content": null,
            "pubDate": "2021-10-18 19:34:18",
            "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/cracked-cellphone-scre.jpg",
            "source_id": "phys"
        },
        {
            "title": "Canadian women happy to be back together for home games against New Zealand",
            "link": "https://lethbridgenewsnow.com/2021/10/18/canadian-women-happy-to-be-back-together-for-home-games-against-new-zealand/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Some 2 1/2 months after winning gold at the Tokyo Olympics, Desiree Scott says she is still pinching herself. \"You see a sign that (says) Olympic gold...",
            "content": "Some 2 1/2 months after winning gold at the Tokyo Olympics, Desiree Scott says she is still pinching herself. “You see a sign that (says) Olympic gold medallist and every time you read that, it solidifies that much more what we accomplished,” said the 34-year-old midfielder from Winnipeg. “It’s still settling in but it’s such a proud moment and honour to be part of that squad.” The gold-medal gang is getting back together this week for a “Celebration Tour,” convening ahead of friendlies against New Zealand in Ottawa on Saturday at TD Place and Oct. 27 at Montreal’s Saputo Stadium. The Canadian women have not played since a penalty shootout win over Sweden in the Aug. 6 Olympic final in Yokohama, Japan. They last played at home on May 18, 2019, when they blanked Mexico 3-0 at BMO Field in Toronto in a warmup match ahead of the 2019 World Cup in France. The 29 matches since then have all been played away from home. “We’re absolutely over the moon … We are beyond pumped to be back in Canada,” said Scott, who plays her club soccer for Kansas City in the NWSL “There’s something different about wearing the Canada red in your home country. And I know fans are going to be excited to get out and see us live.” “To be able to bring this home in front of our fans and really celebrate and feel that support right in those stands is going to be incredible,” she added. While intended as a celebration, the tour also serves as a reunion for the Olympians who were slated to hold their first team dinner planned for Monday. “And it’s going to be just, I think, electric,” said Scott. “We all kind of went our separate ways after Tokyo so it’ll be great to catch up, see what everyone’s been doing post-gold medal and really just catch up and relish and relive those moments that happened this past summer.” Forward Deanne Rose, who has 61 caps for Canada, is also looking forward to a reunion with teammates and fans. “We’ll get to really take in what we’ve done,” said. the 22-year-old from Alliston, Ont., who plays for Reading in England “I don’t think we were able to fully take it in in Tokyo because of the (COVID) restrictions and because of everything. So it’s great to be back with the group.” Coach Bev Priestman has called in all 22 members of the Olympic squad along with four additions: Marie Levasseur from France’s Fleury FC, Victoria Pickett from the NWSL’s Kansas City team, Jade Rose from Harvard University, and Nikayla Small from Wake Forest University. Scott, who has won 167 caps for Canada as well as bronze medals in both the 2012 and ’16 Olympics, had thought Tokyo might be her swansong, especially given the one-year delay in staging the Games. But that has changed. “I thought after the Olympics I was done. But winning that gold medal, being away from the game for a year (during the pandemic) really re-ignited the flame for me,” said the tenacious five-foot-two holding midfielder known as The Destroyer, who doubles as a certified Zumba workout instructor off the pitch. “Being a part of this team, how much I love it, how much of a family we are, how much I still love the sport, it’s definitely given me some things to think about during this off-season. Retirement is a question but it’s not a ‘for sure’ right now.” Canada is currently ranked sixth in the world, compared to No. 23 for New Zealand. The two countries met at the last two World Cups. They played to a scoreless draw in Edmonton in June 2015, with Canada winning 2-0 in Grenoble, France, in June 2019. Canada won 3-0 the last time the two met, at a tournament in China in November 2019. The Canadian women are 8-1-4 all-time against the Football Ferns, with the lone loss coming in their first meeting in December 1987. Canada’s next official matches will be in July at the 2022 CONCACAF W Championship. Scott says the goal is to build on the Olympics. “It’s a stepping-stone for our program,” she said. “We’re hoping to just continue raising the bar from here.” — Follow @NeilMDavidson on Twitter This report by The Canadian Press was first published Oct. 18, 2021 Neil Davidson, The Canadian Press",
            "pubDate": "2021-10-18 19:34:16",
            "image_url": "https://s3.amazonaws.com/socast-superdesk/media/20211018191032/616dcc2f023d16089dbe5057jpeg.jpg",
            "source_id": "lethbridgenewsnow"
        },
        {
            "title": "Canadian women happy to be back together for home games against New Zealand",
            "link": "https://panow.com/2021/10/18/canadian-women-happy-to-be-back-together-for-home-games-against-new-zealand/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Some 2 1/2 months after winning gold at the Tokyo Olympics, Desiree Scott says she is still pinching herself. \"You see a sign that (says) Olympic gold...",
            "content": "Some 2 1/2 months after winning gold at the Tokyo Olympics, Desiree Scott says she is still pinching herself. “You see a sign that (says) Olympic gold medallist and every time you read that, it solidifies that much more what we accomplished,” said the 34-year-old midfielder from Winnipeg. “It’s still settling in but it’s such a proud moment and honour to be part of that squad.” The gold-medal gang is getting back together this week for a “Celebration Tour,” convening ahead of friendlies against New Zealand in Ottawa on Saturday at TD Place and Oct. 27 at Montreal’s Saputo Stadium. The Canadian women have not played since a penalty shootout win over Sweden in the Aug. 6 Olympic final in Yokohama, Japan. They last played at home on May 18, 2019, when they blanked Mexico 3-0 at BMO Field in Toronto in a warmup match ahead of the 2019 World Cup in France. The 29 matches since then have all been played away from home. “We’re absolutely over the moon … We are beyond pumped to be back in Canada,” said Scott, who plays her club soccer for Kansas City in the NWSL “There’s something different about wearing the Canada red in your home country. And I know fans are going to be excited to get out and see us live.” “To be able to bring this home in front of our fans and really celebrate and feel that support right in those stands is going to be incredible,” she added. While intended as a celebration, the tour also serves as a reunion for the Olympians who were slated to hold their first team dinner planned for Monday. “And it’s going to be just, I think, electric,” said Scott. “We all kind of went our separate ways after Tokyo so it’ll be great to catch up, see what everyone’s been doing post-gold medal and really just catch up and relish and relive those moments that happened this past summer.” Forward Deanne Rose, who has 61 caps for Canada, is also looking forward to a reunion with teammates and fans. “We’ll get to really take in what we’ve done,” said. the 22-year-old from Alliston, Ont., who plays for Reading in England “I don’t think we were able to fully take it in in Tokyo because of the (COVID) restrictions and because of everything. So it’s great to be back with the group.” Coach Bev Priestman has called in all 22 members of the Olympic squad along with four additions: Marie Levasseur from France’s Fleury FC, Victoria Pickett from the NWSL’s Kansas City team, Jade Rose from Harvard University, and Nikayla Small from Wake Forest University. Scott, who has won 167 caps for Canada as well as bronze medals in both the 2012 and ’16 Olympics, had thought Tokyo might be her swansong, especially given the one-year delay in staging the Games. But that has changed. “I thought after the Olympics I was done. But winning that gold medal, being away from the game for a year (during the pandemic) really re-ignited the flame for me,” said the tenacious five-foot-two holding midfielder known as The Destroyer, who doubles as a certified Zumba workout instructor off the pitch. “Being a part of this team, how much I love it, how much of a family we are, how much I still love the sport, it’s definitely given me some things to think about during this off-season. Retirement is a question but it’s not a ‘for sure’ right now.” Canada is currently ranked sixth in the world, compared to No. 23 for New Zealand. The two countries met at the last two World Cups. They played to a scoreless draw in Edmonton in June 2015, with Canada winning 2-0 in Grenoble, France, in June 2019. Canada won 3-0 the last time the two met, at a tournament in China in November 2019. The Canadian women are 8-1-4 all-time against the Football Ferns, with the lone loss coming in their first meeting in December 1987. Canada’s next official matches will be in July at the 2022 CONCACAF W Championship. Scott says the goal is to build on the Olympics. “It’s a stepping-stone for our program,” she said. “We’re hoping to just continue raising the bar from here.” — Follow @NeilMDavidson on Twitter This report by The Canadian Press was first published Oct. 18, 2021 Neil Davidson, The Canadian Press",
            "pubDate": "2021-10-18 19:34:12",
            "image_url": "https://s3.amazonaws.com/socast-superdesk/media/20211018191032/616dcc2f023d16089dbe5057jpeg.jpg",
            "source_id": "panow"
        },
        {
            "title": "25 Of The Best \"Succession\" Tweets That Summarize The Perfectly Chaotic Season Premiere",
            "link": "https://www.buzzfeed.com/andriamoore/best-succession-tweets-season-3-premiere",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "*Cue that piano opening.*View Entire Post ›",
            "content": null,
            "pubDate": "2021-10-18 19:34:08",
            "image_url": "https://img.buzzfeed.com/buzzfeed-static/static/2021-10/18/19/campaign_images/6ecd001f66d0/25-of-the-best-succession-tweets-that-summarize-t-2-1124-1634585269-45_dblbig.jpg",
            "source_id": "buzzfeed"
        }
    ],
    "nextPage": 1
}